---
type: ValueAtPoint
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 2
tags: [revit-api, class]
---

# ValueAtPoint

`Autodesk.Revit.DB.Analysis.ValueAtPoint` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ValueAtPoint | — | `` |
| Method | SetFlags | — | `` |